# Relat√≥rio de Analise V

## Tratamento de Dados Faltantes

In [40]:
#Importando a biblioteca
import pandas as pd

In [41]:
#Leitura da Database e armazenamento em objeto
dados = pd.read_csv("Dados/aluguel_Residencial.csv", sep=";")
dados.head(15)

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Apartamento,Leblon,2,0,0,70,3000.0,760.0,NaN
1,Apartamento,Ipanema,4,2,2,210,28000.0,3020.0,9247.0
2,Apartamento,Vicente de Carvalho,1,0,0,55,600.0,NaN,16.0
3,Apartamento,Flamengo,3,0,0,115,2700.0,728.0,223.0
4,Apartamento,Bento Ribeiro,2,1,0,53,900.0,510.0,NaN
5,Apartamento,Leblon,4,3,1,178,15000.0,3000.0,NaN
6,Apartamento,Barra da Tijuca,2,1,1,94,2200.0,1379.0,252.0
7,Apartamento,Cachambi,2,1,0,70,1300.0,550.0,NaN
8,Apartamento,Todos os Santos,3,0,0,70,1000.0,340.0,15.0
9,Apartamento,Vila Isabel,3,1,0,80,1800.0,600.0,72.0
10,Apartamento,Tijuca,1,0,0,42,1600.0,550.0,20.0
11,Apartamento,Barra da Tijuca,4,4,4,290,15000.0,5000.0,15000.0
12,Apartamento,Copacabana,3,0,0,103,6000.0,780.0,240.0
13,Apartamento,Centro,0,0,0,32,700.0,358.0,21.0
14,Apartamento,Barra da Tijuca,3,2,1,117,4500.0,1000.0,624.0

In [42]:
#Tamanho do Data Frame
A = dados.shape[0]
A

22580

In [43]:
#Exibi√ß√£o dos Valores Null
dados[dados['Valor'].isnull()]

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
13298,Apartamento,Barra da Tijuca,2,1,1,70,NaN,970.0,68.0
13927,Apartamento,Copacabana,2,0,0,72,NaN,850.0,NaN
13987,Apartamento,Botafogo,2,0,0,95,NaN,1010.0,170.0
14445,Apartamento,Leme,2,0,0,75,NaN,878.0,NaN
15399,Apartamento,Leme,2,0,1,75,NaN,878.0,NaN
16971,Apartamento,Gl√≥ria,3,0,1,135,NaN,910.0,228.0
17506,Apartamento,G√°vea,3,1,1,105,NaN,880.0,221.0
19615,Casa,Campo Grande,3,2,1,100,NaN,NaN,NaN
19836,Casa,Campo Grande,3,4,3,363,NaN,NaN,NaN

In [44]:
dados.dropna(subset = ["Valor"], inplace = True)

In [45]:
#Tamanho do Data Frame p√≥s remover os valores Null
B = dados.shape[0]
B

22571

In [46]:
#Diferen√ßa de um tamanho para o outro:
A-B

9

In [47]:
#Prova de que o DataFrame n√£o possui mais valores nulos
dados[dados['Valor'].isnull()]

Empty DataFrame
Columns: [Tipo, Bairro, Quartos, Vagas, Suites, Area, Valor, Condominio, IPTU]
Index: []

## Tratamento de Dados faltantes (continua√ß√£o)

In [48]:
#Numeros de Resid√™ncia sem valores de Condom√≠nio (null)
dados[dados["Condominio"].isnull()].shape[0]

1813

In [49]:
#Selecionando os apartamentos que possuem condominio null (Considerados dados errados)
selecao = (dados['Tipo'] == "Apartamento") & (dados["Condominio"].isnull())
dados[selecao].shape[0]

745

In [50]:
#Retirando os dados dos apartamentos com condominios nulos
dados = dados[~selecao]
dados[selecao].shape[0]

C:\Users\Administrator\anaconda3\lib\site-packages\ipykernel_launcher.py:3: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  This is separate from the ipykernel package so we can avoid doing imports until

0

In [52]:
#Numeros de Resid√™ncia(~Apartamento) sem valores de Condom√≠nio (null)
dados[dados["Condominio"].isnull()].shape[0]

1068

In [53]:
dados.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 21826 entries, 0 to 22579
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Tipo        21826 non-null  object
 1   Bairro      21826 non-null  object
 2   Quartos     21826 non-null  int64
 3   Vagas       21826 non-null  int64
 4   Suites      21826 non-null  int64
 5   Area        21826 non-null  int64
 6   Valor       21826 non-null  float64
 7   Condominio  20758 non-null  float64
 8   IPTU        15685 non-null  float64
dtypes: float64(3), int64(4), object(2)
memory usage: 1.7+ MB

In [54]:
#Substituindo os valores null aceitaveis para 0
#dados.fillna(0, inplace = True) -> Op√ß√£o 1
dados = dados.fillna({"Condominio":0, "IPTU":0}) #-> Op√ß√£o 2

In [55]:
#Verificando que todos os dados nulos forama substituidos e n√£o existe mais nulos no Data Frame
dados.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 21826 entries, 0 to 22579
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Tipo        21826 non-null  object
 1   Bairro      21826 non-null  object
 2   Quartos     21826 non-null  int64
 3   Vagas       21826 non-null  int64
 4   Suites      21826 non-null  int64
 5   Area        21826 non-null  int64
 6   Valor       21826 non-null  float64
 7   Condominio  21826 non-null  float64
 8   IPTU        21826 non-null  float64
dtypes: float64(3), int64(4), object(2)
memory usage: 1.7+ MB

In [56]:
#Exportando novamente o DataFrame
dados.to_csv("Dados/aluguel_Residencial.csv", sep=";", index=False)